[{"date":"2019-05-30T00:00:00.000Z","version":"6.5.4","channel":"stable","link":null,"major":["Environment JSON now remembers key order (PR:1497:develohpanda)","Add ability to change password from within the app"],"minor":["More flexible OpenAPI import validation (PR:1515:rmedaer)","Code blocks now displayed at full-width in rendered Markdown"],"fixes":["Icon now displays in Windows control panel (PR:1514:banksio)","A few improvements around the new recent-requests switcher","Dialogs now work within Folder Action plugins","File Template Tag now allows selection of any file type","Text no longer disappears when re-ordering sub environments","Revert change that caused Linux icon to disappear"]},{"date":"2019-05-15T00:00:00.000Z","version":"6.5.3","channel":"stable","link":null,"major":["Quickly switch between recent requests with ctrl+Tab","Show when response was sent in top-right and in Timeline"],"minor":["Increased default autocomplete delay","Request switcher now sorts by last used","Increase NeDB corruption threshold","Add reference to create a Run In Insomnia button in export dialog","Better sync beta onboarding"],"fixes":["Fix inifinite loop sometimes when using Response Tag in environments","Keep OAuth 2.0 refresh token if a new one isn't provided","Quotes now supported in Response Tag filter","Drag and drop works again for empty folders","GraphQL documentation links now open in default browser","Body no longer loses focus shortly after changing body type","Code blocks in documentation Markdown now scroll on x axis","More reliable plugin installs via updated bundled Yarn","Prompt Tag using default values is now more reliable","Only create desktop icon during installation, not update"]},{"date":"2019-05-07T00:00:00.000Z","version":"6.5.1","channel":"stable","link":null,"major":["Pin requests to sidebar (PR:1471:develohpanda)","Ability for plugins to define action within folder menu"],"minor":["Font selection now includes Book font styles","Adjust 405 status code description (PR:1479:rafaelrenanpacheco)","Improved error message for OpenAPI import","Update to latest httpsnippet for code generation"],"fixes":["Fix request dependency behavior setting","Prompts and alerts now work for plugin hooks"]},{"date":"2019-04-29T00:00:00.000Z","version":"6.4.2","channel":"stable","link":null,"major":["Support MacOS Dark mode (PR:1366:sozercan)"],"minor":["Reorganized app preferences layout","Ability to automatically send dependent requests in Response Tag","Can now configure timeline to show larger uploaded data chunks","Add new hotkey for quickly creating requests","Add setMethod and to plugin API","Add network context for plugin API for sending requests","Show hotkey for deleting request in request dropdown"],"fixes":["Fix blank preference pane for some environments","Fix OAuth 1 settings not updating","Less-strict validation on Swagger imports","Prevent links from opening when selecting text in response","Fix canceling requests when in download mode","Strip non-breaking spaces breaking GraphQL query editing"]},{"date":"2019-04-23T00:00:00.000Z","version":"6.4.1","channel":"stable","link":null,"major":[],"minor":["Add open-on-hover functionality when dragging requests into closed folders in sidebar (PR:1442:develohpanda)"],"fixes":["Fix OAuth 2 settings not updating","Fix performance regression causing slow UI updates with many requests","Hide non-functional Quit menu item on non-Mac platforms","Fix URL overflow bug within response history dropdown (PR:1441:develohpanda)","Fix data export in JSON format"]},{"date":"2019-04-22T00:00:00.000Z","version":"6.4.0","channel":"stable","link":null,"major":["Keyboard shortcuts are now configurable! (PR:1403:rickychandra)","Add ability to select specific requests during data export (PR:1396:rickychandra)","OpenAPI v3 Importer (PR:1430:notjosh)"],"minor":["Setting to configure autocomplete popup delay (PR:1323:rafaelrenanpacheco)","Add ability to purge responses in workspace settings dialog (PR:1317:rickychandra)","OAuth 2.0 will now automatically refetch tokens if refresh returns 401 status (PR:1338:rafaelrenanpacheco)","Add new high-contrast theme","Add setAuthenticationParameter, getAuthentication and setUrl methods to plugin context for requests (PR:1393:samirnijenhuis)","Add JavaScript fetch API to code generation (PR:1343:peoplenarthax)","Add ability to specify encoding for base64 template tag (PR:1349:aldaris)","Add HAWK option for payload validation (PR:1339:rpless)","Ensure hidden modals and dropdowns are not visible to screen readers","Better error handling for plugin installs on Windows (PR:1425:senoctar)","OAuth 2.0 will fallback to id_token if access_token does not exist (PR:1408:Dirbaio)","Add YAML as an export option (PR:1409:everplays)","Add setting to configure number of saved responses per request (PR:1378:Grimones)"],"fixes":["Improved performance of GraphQL editor","Prevent Escape from closing modals in Vim mode (PR:1429:ernestre)"]},{"date":"2018-12-19T00:00:00.000Z","version":"6.3.2","channel":"stable","link":null,"major":[],"minor":[],"fixes":["OAuth 1.0 works again"]},{"date":"2018-12-16T00:00:00.000Z","version":"6.3.1","channel":"stable","link":null,"major":["Add mnemonics to menu items for Windows/Linux (PR:1221:tostringtheory)","New option to reference query parameters in Request template tag (PR:1301:tostringtheory)"],"minor":["Add startup task to delete zombie response bodies from filesystem (PR:1292:rickychandra)","Display folder names when selecting a request in the template tag editor (PR:1293:rickychandra)","Tabs now highlighted when focused, and improved keyboard navigation for tabs (PR:1300:tostringtheory)"],"fixes":["Code generation works again","Prevent race condition where switching between GraphQL requests quickly would cause the request body to get overwritten","More robust positioning of dropdown menus when close to screen edge","Undo now works properly after GraphQL prettify","Handle edge case that caused some Swagger imports to not import all request (PR:1302:thewheat)","Update GraphQL library dependencies to fix minor bugs","Code editor now displays a marker in the gutter for errors (had been broken for a long time)","Response preview tab now refreshes properly when the tab was not active (PR:1294:rickychandra)","Prevent negative timeout values from being passed to libcurl and throwing an error"]},{"date":"2018-11-30T00:00:00.000Z","version":"6.2.3","channel":"stable","link":null,"major":["Add ability to toggle variables to show their source, instead of rendered value (see hotkey in preferences) (PR:1274:dhruv944)"],"minor":["Add ext feature for HAWK authentication (PR:1266:rpless)","Fix About screen showing undefined for Electron version (PR:1267:zhanghanyun)","Font ligatures visibility now disabled by default","Hotkey to focus response body (PR:1265:rickychandra)"],"fixes":["More robust movement of requests to different workspaces","GraphQL Schema button no longer overlaps modal dialogs"]},{"date":"2018-11-08T00:00:00.000Z","version":"6.2.0","channel":"stable","link":null,"major":["Configurable interface fonts (PR:1213:evanslify)","Support Postman 2.1 data format (PR:1233:coderjoe)","Imported Swagger tags now create folders (PR:1211:thewheat)","Add preference to change indent from tabs to spaces (PR:1117:Masov)","Support importing Postman Basic, Digest, Bearer, OAuth, and AWS auth (PR:1244:coderjoe)"],"minor":["URLs in Headers pane now clickable (PR:1186:KarthikSiddarth)","Sort workspaces alphabetically by name (PR:1179:Masov)","Clojure EDN syntax support (PR:1176:JoelSanchez)","Add resource parameter to OAuth 2.0 (PR:1174:DevinCarr)","Preserve HAR comments during import (PR:1198:Atvaark)","Better query param ordering in code generation (PR:1192:jamesallured)","Ability to disable update notification on Linux (PR:1234:artywhite)","Add INSOMNIA_DATA_PATH environment variable to change Insomnia data directory (PR:1230:danothemen)","Support file type filtering for plugins (PR:1131:nickhomme)","Added Send And Download option to advanced sending menu","Additional workspace sync settings to disable syncing of cookie jar and SSL client certificates","Support npm version suffix when installing plugins"],"fixes":["Python Requests code generation query (PR:1200:thewheat)","Ignore parameters entry when importing Swagger (PR:1197:beardeddragon5)","Clear Content-Type header when selecting No Body (PR:1214:thewheat)","Smarter GraphQL schema fetching, and ability to disable auto-fetching","Linux deb and AppImage now built on older 14.04 OS again","Prevent HTML injection in autocomplete menu","Whitespace before URL no longer breaks","Fix prompt plugin always prompting","Dropdown menus no longer get squished by small sidebar","Fix plugin installs when spaces exist in file path","Dollar symbol support for Curl command imports","Warn use when switching from Form to JSON request body"]},{"date":"2018-08-16T00:00:00.000Z","version":"6.0.3-beta.1","channel":"beta","link":null,"major":[],"minor":["Additional workspace sync settings to disable syncing of cookie jar and SSL client certificates"],"fixes":[]},{"date":"2018-08-01T00:00:00.000Z","version":"6.0.2","channel":"stable","link":null,"major":[],"minor":["Recursive variable improvements"],"fixes":["Fixed unicode handling in JSON responses","Fixed AWS auth signing with invalid Content-Type header","Snap builds working again","Linux package now built with Ubuntu 14.04","Don't crash on plugin error"]},{"date":"2018-07-25T00:00:00.000Z","version":"6.0.1","channel":"stable","link":null,"major":[],"minor":["GraphQL query highlighting improvements"],"fixes":["Invisible cursor/selection now visible again on default theme","Fixed unicode escaping","Fixed the sync button no longer being pinned to bottom of sidebar"]},{"date":"2018-07-24T00:00:00.000Z","version":"6.0.0","channel":"stable","link":null,"major":["Themes no longer restricted to premium users","One Dark and One Light themes (PR:1044:seanwash)","GraphQL queries now show reference documentation mouse hover","GraphQL operationName now set based on cursor position (if multiple named queries exist) (PR:990:bwlt)","Can now view GraphQL introspection request's response on failure","Setting to configure environment highlight color style (PR:1042:tippl)","Environments are now sortable from within the Manage Environments dialog","Cookie jar template tag (PR:1039:coolhome)","Added ability for plugins to define themes","New storage API added to plugin API to store/retrieve data","Greatly improved (more strict) fuzzy search"],"minor":["Request template tag now has a new option to get the folder and name","GraphQL introspection query now specifies operationName property","New response.setBody API for plugin response hooks","ASAP Auth now default additionalClaims to empty object (PR:953:gerrytan)","Now purge raw response bodies when responses are deleted from history","Added styling for ordered lists to markdown previews","Add audience parameter to implicit OAuth 2.0 grant type (PR:1009:delianides)","Improvements to autocomplete when editing GraphQL variables","More token types supported for syntax highlighting of Markdown previews (docs)","Request switcher (Cmd+p) now sorts results by best match","GraphQL operationName now shown below query editor when set","Add button to clear current sidebar filter","Prompt tag now supports masked input (type=password) (PR:1036:flipxfx)","Add ability to see response for failed OAuth 2.0 token fetch requests","Theme thumbnails are now generated SVGs instead of screenshots"],"fixes":["No longer specify multipart/form-data boundary when generating Curl requests","Curl code generation now respects URL encoding option (PR:979:besolov)","Environment now works as expected when no active request is selected","The prompt template tag now only executes once per request","No longer fail to render when comment ('#}') is included in GraphQL query","Small fix related to same-variable-name environment merging","Support absent Content-Type header for AWS authentication","Improved error handling for async template tag errors","Better response preview webview charset handling","Tag editor dialog preview no longer jumps when an error is present"]},{"date":"2018-07-21T00:00:00.000Z","version":"6.0.0-beta.2","channel":"beta","link":null,"major":["One Dark and One Light themes (PR:1044:seanwash)","Setting to configure environment highlight color style (PR:1042:tippl)","Cookie jar template tag (PR:1039:coolhome)","Added ability for plugins to define themes"],"minor":["Prompt tag now supports masked input (type=password) (PR:1036:flipxfx)","Add ability to see response for failed OAuth 2.0 token fetch requests","Theme thumbnails are now generated SVGs instead of screenshots"],"fixes":["Support absent Content-Type header for AWS authentication","Improved error handling for async template tag errors","Better response preview webview charset handling","Tag editor dialog preview no longer jumps when an error is present"]},{"date":"2018-06-29T00:00:00.000Z","version":"6.0.0-beta.1","channel":"beta","link":null,"major":["GraphQL queries now show reference documentation mouse hover","Environments are now sortable from within the Manage Environments dialog","Greatly improved (more strict) fuzzy search","GraphQL operationName now set based on cursor position (if multiple named queries exist) (PR:990:bwlt)","Can now view GraphQL introspection request's response on failure","Colorschemes no longer restricted to premium users","New storage API added to plugin API to store/retrieve data"],"minor":["Request template tag now has a new option to get the folder and name","GraphQL introspection query now specifies operationName property","New response.setBody API for plugin response hooks","ASAP Auth now default additionalClaims to empty object (PR:953:gerrytan)","Now purge raw response bodies when responses are deleted from history","Added styling for ordered lists to markdown previews","Add audience parameter to implicit OAuth 2.0 grant type (PR:1009:delianides)","Improvements to autocomplete when editing GraphQL variables","More token types supported for syntax highlighting of Markdown previews (docs)","Request switcher (Cmd+p) now sorts results by best match","GraphQL operationName now shown below query editor when set","Add button to clear current sidebar filter"],"fixes":["No longer specify multipart/form-data boundary when generating Curl requests","Curl code generation now respects URL encoding option (PR:979:besolov)","Environment now works as expected when no active request is selected","The prompt template tag now only executes once per request","No longer fail to render when comment ('#}') is included in GraphQL query","Small fix related to same-variable-name environment merging"]},{"date":"2018-05-25T00:00:00.000Z","version":"5.16.6","channel":"stable","link":null,"major":[],"minor":["Preserve undo history of request body editor when switching requests"],"fixes":["Critical fix that prevented new environments from being created","Code editors no longer undo all the way back to an empty editor"]},{"date":"2018-05-24T00:00:00.000Z","version":"5.16.5","channel":"stable","link":null,"major":[],"minor":["New folders now default to expanded instead of collapsed"],"fixes":["Double-click rename in sidebar works again"]},{"date":"2018-05-23T00:00:00.000Z","version":"5.16.4","channel":"stable","link":null,"major":["Fuzzy search in request switcher on URL, method, and query string and highlight matches in switcher and sidebar (PR:864:axs221)"],"minor":["Support NPM scoped modules as plugins (PR:914:skang0601)","Add YAML extension to whitelist for imports (PR:919:avdv)","Remove Analytics tracking (for GDPR)"],"fixes":["GraphQL query linting works again"]},{"date":"2018-05-04T00:00:00.000Z","version":"5.16.2","channel":"stable","link":null,"major":[],"minor":["Headers with empty values are now sent"],"fixes":["Remove debounce for OAuth forms (was causing issues)","Fix AWS auth not applying some settings","Include nghttp2lib dependency in Linux builds"]},{"date":"2018-04-26T00:00:00.000Z","version":"5.16.1","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fix Insomnia Plus/Teams login form error"]},{"date":"2018-04-25T00:00:00.000Z","version":"5.16.0","channel":"stable","link":null,"major":["Insomnia now available as a Snap package (Linux)!","Autocomplete support in GraphQL variables editor","Support HMAC-SHA256 for OAuth 1.0","Linux builds now include statically linked libcurl (removes libcurl3 dependency)","Response hooks can now access the request API context"],"minor":["Reloading plugins now traverses all files in plugin's directory","Add ability for {% prompt %} tag to cache values in memory","Add application/graphql and text/xml to content-type autocomplete","Mention Swagger support on import dialog (PR:863:scop)","GraphQL schema now fetched whenever the request is modified","Change default interface font to use native OS fonts instead of Open Sans","No longer constrain height of URL preview on Query tab (PR:873:j-collier)","Spelling fixes (PR:862:scop)","Upgrade to Electron 1.8"],"fixes":["Handle charsets correctly in webview preview","Fix unsupported charset decoding failures","Fix parameter replacement in Swagger imports (PR:861:avdv)","Header tab now refreshes properly after switching content-type","Response audio viewer no longer shows stale response"]},{"date":"2018-04-02T00:00:00.000Z","version":"5.15.0","channel":"stable","link":null,"major":["New template tag for executing JSONPath queries on arbitrary  strings. This is useful if you include stringified JSON in your environment or are using the file template tag.\n","Folders and requests can now be moved to different workspaces. This can be done via the folder's dropdown menu in the sidebar or in the request settings dialog.\n","Additional claims field now available on ASAP authentication (PR:822:BCook98)","GraphQL schema fetches now share OAuth 2.0 tokens with parent request."],"minor":["Request hook plugins now executed for GraphQL introspection requests,  code generation, and HAR export.\n","Ability to toggle OAuth 1/2 authentication on and off via checkbox.","Support Curl's --path-as-is flag. This can be toggled in the request settings dialog.","Region and service fields can now be explicitly set for AWS authentication.","Query parameter values can now be multi-line.","Key-value editors now have a delete-all option, available in new dropdown menu in bottom-left.","Verifier field can now be set for OAuth 1.0 authentication.","Response body now logged when OAuth 2.0 token fetches fail.","Authorization prefix label can now be specified when using Bearer authentication.","Ability to read/write query parameters added to plugin API. Thanks amree and luveti for the help!","Rename placeholder in header editor. (PR:820:benatkin)","Upgrade Electron to include patch for webview security vulnerability.","Update Windows code signing certificate.","Plugin download errors are now handled and logged properly.","Plugin installs now work with custom .npmrc configs","Prompt template tag now has additional option to cache results","Behind-the-scenes refactor to get ready for fuzzy matching improvements. (PR:797:axs221)"],"fixes":["Request name and parent folder no longer reverted when selecting previous history item.","GraphQL introspection requests are no longer synced or exported.","Choosing an environment color no longer affects multiple environments (rare bug).","Form URLEncoded no longer forgets if the value type is set to multi-line.","No longer requires write permission when including files in multipart form data.","Backslashes inside template tags no longer break previews.","Escaped unicode sequences now show properly in environment editor.","Generated Curl commands now handle duplicate query parameter names.","CSV and multipart response viewers no longer show stale responses.","URLs in autocomplete results no longer prevent variables and tags from being shown.","Prompt template tag no longer uses stale values."]},{"date":"2018-03-03T00:00:00.000Z","version":"5.14.9","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fixed not being able to change body type on new requests"]},{"date":"2018-03-02T00:00:00.000Z","version":"5.14.8","channel":"stable","link":null,"major":[],"minor":["Switching request to No Body now remembers previous body if re-enabled","Prompt to create folder is now cancelable","Update internal prompt plugin"],"fixes":["Fixed response viewer not updating correctly sometimes"]},{"date":"2018-02-14T00:00:00.000Z","version":"5.14.7","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fix app icon on Linux"]},{"date":"2018-02-07T00:00:00.000Z","version":"5.14.6","channel":"stable","link":null,"major":["Basic support for importing Swagger 2.0 projects (PR:695:slawus)","Add RSA-SHA1 signing for OAuth 1.0 (PR:611:c22)","Response history now shows URL instead of time and size (PR:721:iansu)"],"minor":["Support AWS multifactor auth (PR:730:focusaurus)","Add audience field to OAuth 2.0 client credentials grant (PR:679:narhen)","Add OpenID response type for OAuth 2.0 implicit grant (PR:681:emdfonseca)","Support INSOMNIA_DISABLE_AUTOMATIC_UPDATES environment variable","Always show accurate HTTP status message (never default)","Plugin arguments can now define a validate function","Support XPath string results","Added enable/disable toggle to most authentication types","XPath queries no longer required to begin with forward slash","New template tag to prompt for user input","New OS template tag for accessing operating system values","getBodyText and setBodyText added to plugin API"],"fixes":["Fix GraphQL autocomplete in nested blocks","Fix code generation when multipart/form-data present","Attempt to fix certain network requests hanging","Fix body type changing automatically when content-type header updated","GraphQL queries now work with OAuth 2.0 requests","Base environment name no longer editable"]},{"date":"2017-12-01T00:00:00.000Z","version":"5.12.4","channel":"stable","link":null,"major":[],"minor":["Support INSOMNIA_DISABLE_AUTOMATIC_UPDATES environment variable"],"fixes":["Fix GraphQL autocomplete in nested blocks","Fix code generation when multipart/form-data present","Fix certain network requests hanging during DNS lookup"]},{"date":"2017-11-30T00:00:00.000Z","version":"5.12.4-beta.2","channel":"beta","link":null,"major":[],"minor":["Support INSOMNIA_DISABLE_AUTOMATIC_UPDATES environment variable"],"fixes":["Fix GraphQL autocomplete in nested blocks","Fix code generation when multipart/form-data present","Attempt to fix certain network requests hanging"]},{"date":"2017-11-28T00:00:00.000Z","version":"5.12.3","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fix responses displaying as binary in last update"]},{"date":"2017-11-27T00:00:00.000Z","version":"5.12.1","channel":"stable","link":null,"major":["Less obtrusive update notification"],"minor":["Response timer always shows 1 decimal place (PR:617:k-nut)","Ability to specify auto-update channel","Ability to disable auto-updates","Moved database to the Electron main thread","Use Google analytics API directly (no more external JS!)","Faster storing of large response bodies","Provide a convenient save button when large response gets hidden","Disable request body linting over 1MB","Add import/export APIs to plugin system"],"fixes":["Fix environments disappearing during workspace duplication and sync","Support for downloading huge files (over ~2GB)","Fixed HAWK algorithm selection","Fix environment editor not saving immediately after fixing an error","Minor fix for Postman import"]},{"date":"2017-11-23T00:00:00.000Z","version":"5.12.0-beta.3","channel":"beta","link":null,"major":[],"minor":["Faster storing of large response bodies","Provide a convenient save button when large response gets hidden"],"fixes":["Fix environment editor not saving immediately after fixing an error","Fix environment editor not always refreshing after data sync"]},{"date":"2017-11-21T00:00:00.000Z","version":"5.12.0-beta.2","channel":"beta","link":null,"major":["Less obtrusive update notification"],"minor":["Response timer always shows 1 decimal place (PR:617:k-nut)","Ability to specify auto-update channel","Ability to disable auto-updates","Moved database to the Electron main thread","Use Google analytics API directly (no more external JS!)"],"fixes":["Support for downloading huge files (over ~2GB)","Fixed HAWK algorithm selection"]},{"date":"2017-11-14T00:00:00.000Z","version":"5.11.7","channel":"stable","link":null,"major":["First-party support for viewing multipart responses"],"minor":[],"fixes":["Accept header now overridable again","Support showing multiple response headers with the same name"]},{"date":"2017-11-10T00:00:00.000Z","version":"5.11.5","channel":"stable","link":null,"major":[],"minor":["OAuth 2.0 requests now use same settings as current request","Environment editor now refreshes from sync change when it's open","Improvements to Curl importer","Add back default Accept header from v5.11.0 but not Accept-Encoding","New keyboard shortcut to delete active request","Prompt user to automatically change Content-Type when binary file is selected","Update documentation links to point to new support website"],"fixes":["Fix bug where dragging a folder into itself would make it disappear"]},{"date":"2017-11-08T00:00:00.000Z","version":"5.11.0","channel":"stable","link":null,"major":["OAuth 1.0 Support (PR:571:besolov)","Atlassian ASAP Auth Support (PR:566:gerrytan)","No longer require global npm to install plugins (included standalone Yarn)"],"minor":["Print Curl version in Timeline","Template tag editor no longer has delay when opening","Added debug logging to OAuth 2.0 flow","Support wildcards in port for client certificates","Use more unique temporary director name to avoid conflicts","No longer send default Accept and Accept-Encoding headers"],"fixes":["Fix GraphQL autocompletion not working","Fix scroll jumping issue in key-value editors (headers, query, etc)","Fix Cmd+Enter conflict in Sublime keymap","Fix for raw cookie editor deleting cookies"]},{"date":"2017-11-01T00:00:00.000Z","version":"5.10.1","channel":"stable","link":null,"major":["Ability to export workspace as HAR (PR:523:Atvaark)","Can now drag-n-drop files to import","Client certificates can now be made private (never synced)","GraphQL now sends operationName automatically","New template tags for hashing and reading files"],"minor":["Minor tweaks to template tag editor","Keyboard shortcut to refresh all plugins","New plugin API methods to set request settings (eg. cookie send behavior)"],"fixes":["Fixed cookies being deleted when editing (sometimes)","Closing environment editor too quickly no longer loses changes","Multipart handling works with large files again (above 2GB)","Other minor fixes"]},{"date":"2017-10-13T00:00:00.000Z","version":"5.9.6","channel":"stable","link":null,"major":["Rewrote PDF response preview for better performance and retina support","Can now use boolean type in template tag arguments (plugins)"],"minor":["Moved multipart/form-data generation from libcurl into Insomnia","New setting to display all template tags and variables in raw text"],"fixes":["PDF response preview works again","Render failures in cookie dialog no longer prevent it from opening","Fix refresh button in template tag editor","Add React 16 error boundaries so unhandled errors will do less harm"]},{"date":"2017-10-12T00:00:00.000Z","version":"5.9.2","channel":"stable","link":null,"major":["Can now use environment variables inside template tags"],"minor":["Support attribute XPath queries","Faster prettify for large responses","File downloads now use name from Content-Disposition header when available","Upgrade to React 16 (10% faster render performance)","Auto-select active environment when opening environment editor","Added menu option to show app data folder","Improved robustness of template tag editor"],"fixes":["Autocomplete no longer breaks on template tags containing no arguments (rare case)","Null values in environments no longer cause problems","Fix client certificates not working sometimes on Windows","Fix AWS auth for non POST/GET methods"]},{"date":"2017-09-18T00:00:00.000Z","version":"5.8.4","channel":"stable","link":null,"major":["More keyboard shortcuts (see preferences for details)","Properly catch and handle plugin errors on app launch"],"minor":["Added menu item to show dev tools"],"fixes":["Fixed GraphQL and cookie list scroll overflow issue"]},{"date":"2017-09-13T00:00:00.000Z","version":"5.8.3","channel":"stable","link":null,"major":[],"minor":["Add button to refresh GraphQL schema (PR:481:ganderzz)"],"fixes":["Fixed cookie jar not being created for new workspaces"]},{"date":"2017-09-11T00:00:00.000Z","version":"5.8.2","channel":"stable","link":null,"major":["New cookie editing flow (PR:448:BeeeQueue)","Support templating in cookies (PR:448:BeeeQueue)","HAWK authentication (PR:446:jgiovaresco)"],"minor":["Environment functions on plugin API (PR:443:Xuanwo)","Fuzzy filtering now used in all UI filter inputs","Request method now shown in tag editor (PR:453:derpoho)","Don't touch already-encoded characters in URL","Add HTML content-type detection"],"fixes":["Blocker for large responses works again","Prevent modal dialogs from closing when escaping autocomplete","Prevent Content-Length integer overflow for uploads over 2GB"]},{"date":"2017-08-16T00:00:00.000Z","version":"5.7.14","channel":"stable","link":null,"major":[],"minor":["Made max redirects configurable in settings"],"fixes":["Fixed requests hanging for a subset of Windows users"]},{"date":"2017-08-14T00:00:00.000Z","version":"5.7.12","channel":"stable","link":null,"major":[],"minor":["Now show render errors when fetching GraphQL schema"],"fixes":["GraphQL schema fetching failed when using environment variables","Copying large text blobs sometimes yielded a hyphen"]},{"date":"2017-08-12T22:00:00.000Z","version":"5.7.11","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fixed some modal dialogs not refreshing when opened"]},{"date":"2017-08-12T17:00:00.000Z","version":"5.7.10","channel":"stable","link":null,"major":[],"minor":["Show both compressed and uncompressed of responses"],"fixes":["Fixed race condition causing request creation to fail","Large response size check now uses uncompressed size","Fixed invalid cookies causing code generation to break"]},{"date":"2017-08-11T00:00:00.000Z","version":"5.7.9","channel":"stable","link":null,"major":[],"minor":["Add ability to specify Authorization token prefix for OAuth 2.0 Requests","GraphQL schema introspection requests now apply cookies, auth, and all other Insomnia features","GraphQL prettify no longer recursively stringifies variables object","Display schema fetch information for GraphQL","Automatically switch to POST when choosing GraphQL body"],"fixes":["Cap number of redirects to 20 (instead of unlimited)","Over-selecting input bounds no longer clears selection","Don't allow password input text to be copied","Some performance improvements"]},{"date":"2017-08-04T00:00:00.000Z","version":"5.7.4","channel":"stable","link":null,"major":["Template tags now work with prettify feature"],"minor":["More accurate logic for catching OAuth redirect URL (PR:396:starJammer)","Added Help menu item for displaying keyboard shortcuts","Added contact link to About section","Default GraphQL introspection query content-type to application/json"],"fixes":["Fixed GraphQL incorrectly JSON stringifying variables body"]},{"date":"2017-08-02T00:00:00.000Z","version":"5.7.0","channel":"stable","link":null,"major":["New GraphQL request body type","New netrc authentication type (PR:384:moxuz)"],"minor":["Add autodetection for XML when no Content-Type present","Workspaces created by import or sync now marked indicated in UI","Data imports no longer update modified time","Plugin system improvements (still experimental)","Data sync networking improvements"],"fixes":["Fixed downloading response bodies","Do not include literal newline characters in Curl snippets","Change HTTP method to GET on redirects","Fix AWS authentication for GET requests","Colons in header values now handled properly","No longer close search box on Enter"]},{"date":"2017-07-18T00:00:00.000Z","version":"5.6.3","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fixed downloading response bodies"]},{"date":"2017-07-17T00:00:00.000Z","version":"5.6.1","channel":"stable","link":null,"major":["Basic AWS authentication v4 support (PR:347:focusaurus)","Fuzzy searching support for request switcher (PR:204:dmlittle)","Prompt to include private environments on data export, if any exist"],"minor":["More useful error messages in Request Cookie template tag","Add application/vnd.api+json to Content-Type autocomplete (PR:349:synthtech)"],"fixes":["null values within environments no longer break autocomplete","Better handling of environment variables containing Template Tags","Handle protocol-less URLs in OAuth 2 settings (PR:346:NicholasMata)"]},{"date":"2017-06-30T00:00:00.000Z","version":"5.5.2","channel":"stable","link":null,"major":["Added ability to preview PDF responses (PR:325:Antoine38660)","Added ability to assign colors to environments (PR:334)","All dropdown menus are now filterable by typing (PR:340)"],"minor":["Window maximized state now remembered","Response bodies no longer stored in memory (PR:338)"],"fixes":["Fixed dropdown dismissing reliability inside modal dialogs","Fixed unix hostname being confused with domain socket syntax"]},{"date":"2017-06-22T00:00:00.000Z","version":"5.4.0","channel":"stable","link":null,"major":["Support for unix domain sockets using URL format http://unix:SOCKET:PATH","Dedicated Description tab for request documentation","Wildcards now supported in client certificate host"],"minor":["Dropdowns within tabs now only open if tab is already active","Tab lists now scrolls horizontally when too long","Markdown description style improvements","Vastly improved dropdown positioning algorithm","Add back ability to change text editor keymap to Sublime Text"],"fixes":["Prevent opening links multiple times in description preview","Fixed Content-Length not being sent with initial NTLM authorization request","Fixed client certificate toggling not working"]},{"date":"2017-06-15T00:00:00.000Z","version":"5.3.6","channel":"stable","link":null,"major":[],"minor":["Added option to use custom date format with Timestamp tag"],"fixes":["Improve cookie handling with redirects","Fixed workspace duplication active environment bug","Fixed status tag in response history showing ERROR for responses with no HTTP Reason","Fixed autocomplete constants filling with undefined"]},{"date":"2017-06-13T00:00:00.000Z","version":"5.3.3","channel":"stable","link":null,"major":["Can now sort requests and folders together in sidebar"],"minor":[],"fixes":["Fix Markdown description editor height from last update","Much more robust handling when sorting nested sidebar items"]},{"date":"2017-06-12T00:00:00.000Z","version":"5.3.0","channel":"stable","link":null,"major":["Multi-line text values now supported in form data editors","New template tag to reference cookie values","Request snapshot now stored and recovered with response history","Previous response filters are now persisted"],"minor":["Can now send requests with cmdOrCtr+R or F5 keys","Added ability to delete custom HTTP methods","Added ability to delete current response","Markdown descriptions now sanitize HTML input","Markdown descriptions now selectable","Postman imports now included description field"],"fixes":["More robust JSON formatting on content containing escaped characters","Fix stale requests sometimes being sent soon after editing URL","Query preview view now scrolls when too long"]},{"date":"2017-06-06T00:00:00.000Z","version":"5.2.0","channel":"stable","link":null,"major":["Ability to document requests and workspaces using Markdown","Added Bearer authentication helper","Added setting to whitelist hostnames from proxy setting","Ability to duplicate workspace"],"minor":["Setting to disable analytics tracking","URL preview copy button","Experimental plugin support (still undocumented)"],"fixes":["Fixed Client Credentials setting in OAuth form not changing","Other minor UI fixes"]},{"date":"2017-05-29T00:00:00.000Z","version":"5.1.1","channel":"stable","link":null,"major":["Environment editor now warns about invalid variable names and errors"],"minor":["OAuth now uses a password field for password credentials","OAuth authorization window session is now cleared on app launch","Now show folder as prefix when selecting requests for Response Value tag","More appropriate size for app icon"],"fixes":["Fix right-click context menu staying open","No longer error when response contains invalid cookie","Always include equals sign in x-www-form-urlencoded bodies when value is empty"]},{"date":"2017-05-24T00:00:00.000Z","version":"5.1.0","channel":"stable","link":null,"major":["New option to auto-hide menubar on Windows and Linux!","New template tag to reference values from other responses","More friendly Template Tag editor","Ability to save full HTTP response to file, including headers"],"minor":["Data exports now have friendlier names","Unreferenced template tags are longer rendered"],"fixes":["Fix cookie handling for localhost domains","Better handle of JSON when root is a String","File selector no longer clears file on Cancel","Many more fixes fixes"]},{"date":"2017-05-05T00:00:00.000Z","version":"5.0.20","channel":"stable","link":null,"major":[],"minor":["Behind-the-scenes update for new auto-update server"],"fixes":[]},{"date":"2017-05-03T00:00:00.000Z","version":"5.0.12","channel":"stable","link":null,"major":[],"minor":["Add ability to import from URL","Made theme more compact","Performance improvements"],"fixes":["Better handling of Windows line endings","Fixed importing curl commands containing question marks","Minor bug fixes"]},{"date":"2017-04-20T00:00:00.000Z","version":"5.0.10","channel":"stable","link":null,"major":[],"minor":["Improved autocompletion suggestion of URLs","Leave Content-Type header in place when switching body type to Other"],"fixes":["Fixed automatic gzip decoding of responses if Accept header set manually","Correctly handle ISO-8859-1 responses","Prevent showing autocomplete if input loses focus","Now send correct grant type during OAuth 2.0 token refresh","OAuth 2.0 now shows when token expires","Prevent request from sending twice sometimes via keyboard shortcut","No longer fail when HEAD requests return body"]},{"date":"2017-04-14T00:00:00.000Z","version":"5.0.5","channel":"stable","link":null,"major":[],"minor":["New setting to specify indent size in code editors"],"fixes":["Minor bug fixes"]},{"date":"2017-04-11T00:00:00.000Z","version":"5.0.4","channel":"stable","link":null,"major":[],"minor":["Add keyboard shortcut to view hotkey help","Remove var prefix on environment variables","Add link to httpsnippet library in code generation dialog"],"fixes":["Fix cursor unfocusing when editing environment variables","No longer add default content-type or content-length when no request body","Quick switcher now scrolls properly again"]},{"date":"2017-04-09T00:00:00.000Z","version":"5.0.3","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fix Content-Length on binary file uploads","Send more specific Content-Type in multipart uploads","Fix cursors resetting to start of input when switching apps"]},{"date":"2017-04-07T00:00:00.000Z","version":"5.0.2","channel":"stable","link":"https://insomnia.rest/blog/insomnia-5-announcement/","major":["Added new base64 encode/decode template tag"],"minor":["More reliable file uploads"],"fixes":["Fixed body type selection in Create Request dialog","Fixed minor bug with OAuth 2.0 access token handling","Now escape unicode double quotes during JSON formatting","Fixed ampersands in clicked links"]},{"date":"2017-04-05T00:00:00.000Z","version":"5.0.1","channel":"stable","link":"https://insomnia.rest/blog/insomnia-5-announcement/","major":["Contextual autocomplete for environments, URLs, header names/values, and more","All key-value editors are now sortable","Add OAuth 2.0, Digest, and NTLM authentication","New Timeline response tab that shows much more detail about the request","Environment variables and template tags now highlighted throughout the app","Replaced NodeJS networking backend with libcurl","Added per-request settings for controlling cookies, template rendering, and URL encoding","Proxy now supports Digest and NTLM auth types","Support for custom HTTP methods","App panes now resizable when in vertical layout","Many minor performance improvements"],"minor":["Environment editor now respects line wrap setting","App now prompts to sync unrecognized workspaces instead of syncing without asking","Response view types have been reworked to behave more intuitively","Enable context (right-click) menu in response web view","Request body syntax highlighting recognizes more content-types","Better errors for render failures","HTTP proxy can now be toggled on and off","Tabs no longer lose state after switching","Update bracket match style in editor","Window title now reflects active workspace and request","Header names now trimmed of whitespace before sending","Add warning when environments exist, but none are selected","Better styling of numeric counters on tabs","Added tooltip help hints in various places"],"fixes":["No longer auto-encode equals sign in URL path","Cookies now stored on redirects","More reliable sort order after duplicating requests","Clicking on workspaces in request switcher now works again","More reliable querystring importing","Fixed drag-n-drop support within code editor","Headers editor now refreshed after changing body content-type"]},{"date":"2017-02-15T00:00:00.000Z","version":"4.2.14","channel":"stable","link":null,"major":["Add support for private environments which will not be exported or synced","Highlight Nunjucks variables in code editors"],"minor":["Now show escaped unicode characters in response","Add LINK and UNLINK HTTP methods"],"fixes":["Render errors are now displayed again","Fixed deleted synced resources sometimes reappearing"]},{"date":"2017-02-07T00:00:00.000Z","version":"4.2.11","channel":"stable","link":null,"major":["URLs in responses are now clickable"],"minor":["Dropdowns in sidebar and on the send button now trigger on right-click","Now support more than one level of recursive template variables"],"fixes":["JSON pretty printing no longer parses as JavaScript (1.000 will not get rounded)"]},{"date":"2017-02-02T00:00:00.000Z","version":"4.2.9","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fixed network request DNS fallback logic in some cases","Minor bug fixes"]},{"date":"2017-02-01T00:00:00.000Z","version":"4.2.8","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fixed app crashing on first launch :("]},{"date":"2017-01-31T00:00:00.000Z","version":"4.2.7","channel":"stable","link":null,"major":["Added ability to auto-download response bodies to file"],"minor":["Clicking Cancel Account after trial ends now signs out"],"fixes":["Fixed sidebar filtering for nested folders","Fixed binary file uploads missing Content-Length header","Fixed pasting Curl command into URL wouldn't update URL","Fixed code generation only operating on active request"]},{"date":"2017-01-30T00:00:00.000Z","version":"4.2.5","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fixed pasting inside of URL"]},{"date":"2017-01-29T00:00:00.000Z","version":"4.2.4","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fixed pasting into URL not persisting","Fixed webview background (again)"]},{"date":"2017-01-26T00:00:00.000Z","version":"4.2.3","channel":"stable","link":null,"major":["No longer lose body data when switching formats when possible","Fixed memory leak for users with a lot of large request bodies"],"minor":["Minor performance improvements in some areas"],"fixes":["Fixed textarea padding in some menus"]},{"date":"2017-01-25T00:00:00.000Z","version":"4.2.2","channel":"stable","link":null,"major":["New editor key maps (Vim, Emacs, Sublime)"],"minor":["Workspaces now visible in request switcher"],"fixes":["Fixed issue with recursive environment variables not resolving","Fixed webview background color not being white","Fixed label click region in settings menu"]},{"date":"2017-01-23T00:00:00.000Z","version":"4.2.0","channel":"stable","link":"https://insomnia.rest/blog/introducing-color-themes/","major":["Color Themes!"],"minor":[],"fixes":["Fixed problems with editing cookies","Fixed bug with sidebar drag-n-drop","Minor URL encoding tweaks"]},{"date":"2017-01-11T00:00:00.000Z","version":"4.1.1","channel":"stable","link":"https://insomnia.rest/teams/","major":["Support for Insomnia Teams"],"minor":["Sync is now more immediate"],"fixes":["Manually set Host header no longer gets overridden","Fixed synced workspaces reappearing after deletion","Many other sync-related fixes"]},{"date":"2016-12-30T00:00:00.000Z","version":"4.0.13","channel":"stable","link":null,"major":[],"minor":["Now import form data properly from Insomnia 2.0"],"fixes":["Fixed response size showing 0GB sometimes","Temporary fix to automatically flush responses when DB file too big to load (256GB)","Fixed filename not being added to multipart entries","Fixed sync menu not showing up for some users"]},{"date":"2016-12-23T00:00:00.000Z","version":"4.0.12","channel":"stable","link":null,"major":["Code editors now auto-closes brackets and quotes"],"minor":[],"fixes":["Prevent sidebar dragging when editing request names","Fix body still showing after switching to No Body","Fix sidebar footer obscuring Beautify button when collapsed","Added potential fix for some edge case DNS issues"]},{"date":"2016-12-08T00:00:00.000Z","version":"4.0.9","channel":"stable","link":null,"major":[],"minor":["Curl import now supports application/x-www-form-urlencoded","Better error handling during requests","Create top level folder when importing Postman collection","Add default Accept header to all requests","Add default User-Agent header to all requests"],"fixes":["Recursive environment variables with double quotes now work","Second attempt at fixing app icon for certain Linux environments","Fixes for more advanced Curl import commands"]},{"date":"2016-12-05T00:00:00.000Z","version":"4.0.5","channel":"stable","link":null,"major":[],"minor":["Curl import now supports form data","Deleting header/query/form items now required a confirmation click"],"fixes":["Fixed header/query/form delete functionality","Fixed some bugs in the installation process from some machines","Attempt to fix icon on some Linux distributions"]},{"date":"2016-12-01T00:00:00.000Z","version":"4.0.2","channel":"stable","link":"https://insomnia.rest/blog/insomnia-4-announcement/","major":["Insomnia is now out of beta!","Multipart form support (with files)","Binary data support (file uploads)","Response history viewer","Support for importing Postman v2 and HTTP Archive (HAR) formats","All query parameters, headers, form data, and authentication items are now toggleable","New advanced sending options (hold CMD on Mac or Ctrl on Windows)","Huge performance improvements!!!"],"minor":["Much better support for cURL import format (past command into URL)","Code generation now remembers your preferences","Can now import query parameters from Url to query editor","Changed default request body type to none, and improved selection process","Dropdowns now scroll instead of being cut off if not enough room","Selected tab now remembered when changing requests","Can now delete your last workspace (will prompt to create a new one)","Show milliseconds when hovering over response time","Show bytes when hovering over response size"],"fixes":["Fixed nested folders not highlighting correctly sometimes","Requests are now activated after duplicating","Lots and lots of small fixes","Fixed various import bugs"]},{"date":"2016-11-18T00:00:00.000Z","version":"3.7.3","channel":"stable","link":null,"major":[],"minor":["No longer automatically URL encode semicolons or commas in URL pathname","Some minor improvements to sync logic"],"fixes":["Fixed app updates requiring two restarts to take effect","Fixed credit card form to support American Express cards"]},{"date":"2016-11-17T00:00:00.000Z","version":"3.7.1","channel":"stable","link":null,"major":[],"minor":["Improved error handling when editing form data","Improved signup flow"],"fixes":["Fix for environment not being used to render Query preview","Minor bug fixes"]},{"date":"2016-11-15T00:00:00.000Z","version":"3.7.0","channel":"stable","link":null,"major":["Insomnia Cloud Sync is here!","Nested folders now supported"],"minor":["Minor improvements and bug fixes","Rearranges settings menus"],"fixes":["Fixed incrementing response size on keep-alive connections","App new refreshes after importing a Curl command"]},{"date":"2016-11-07T20:22:03.000Z","version":"3.6.8","channel":"stable","link":null,"major":[],"minor":["Minor improvements and bug fixes"],"fixes":[]},{"date":"2016-11-01T17:53:38.000Z","version":"3.6.7","channel":"stable","link":null,"major":["New option to download responses in the response preview dropdown"],"minor":["Synced workspaces no longer default to automatic mode"],"fixes":["Better handling of ENETUNREACH error","Minor tweaks an fixes for the cloud sync beta"]},{"date":"2016-10-27T10:58:48.000Z","version":"3.6.6","channel":"stable","link":null,"major":["Added support for responses that return images"],"minor":[],"fixes":["Fixed some minor edge cases thanks to better error reporting in the last update"]},{"date":"2016-10-27T03:35:02.000Z","version":"3.6.4","channel":"stable","link":null,"major":[],"minor":["Added PURGE and FIND custom HTTP methods","New setting to force stacked layout","Prefer IPv6 addresses and fallback to IPv4 on failure (same behaviour as curl)"],"fixes":["Fixed problem where editing environment name would overwrite changes"]},{"date":"2016-10-25T02:01:10-07:00","version":"3.6.2","channel":"stable","link":null,"major":[],"minor":["Updates for the Insomnia Plus beta"],"fixes":["Loading spinner no longer gets stuck when quitting the app mid-request"]},{"date":"2016-10-21T17:33:58-07:00","version":"3.6.0","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fixed scrolling bug for form encoded request bodies","Fixed rare case where cursor would jump to the end of the URL","The show passwords setting no longer requires an app restart"]},{"date":"2016-10-11T17:21:26-07:00","version":"3.5.13","channel":"stable","link":null,"major":[],"minor":["Update code generation for Swift 3","Prevent window from being placed outside viewable desktop on launch","Updates no longer prompt the user, but show an unobtrusive notification instead"],"fixes":["Some improvements for URL pathname encoding","Setting to disable following redirects now works again"]},{"date":"2016-10-10T18:27:02-07:00","version":"3.5.12","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fixed certain connection problems related to HTTP keep-alive"]},{"date":"2016-10-06T17:39:13-07:00","version":"3.5.11","channel":"stable","link":null,"major":[],"minor":["Reworded some error messages","Made cookie parsing less strict (closer to web browser behaviour)"],"fixes":[]},{"date":"2016-10-05T16:52:28-07:00","version":"3.5.10","channel":"stable","link":null,"major":[],"minor":["Better handling of malformed cookies"],"fixes":["Syntax checking in editor now works again"]},{"date":"2016-10-05T05:13:09-07:00","version":"3.5.7","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fix for cookies not being saved sometimes","Fix for environment editor line numbers background"]},{"date":"2016-10-02T22:46:37-07:00","version":"3.5.6","channel":"stable","link":null,"major":["Hide large responses by default to prevent app from hanging unexpectedly"],"minor":["Add background color to editor line numbers","Change DNS lookup method to use host machine getaddrinfo"],"fixes":[]},{"date":"2016-09-28T22:24:05-07:00","version":"3.5.3","channel":"stable","link":null,"major":[],"minor":["Now automatically treat responses without Content-Type as JSON if possible"],"fixes":["Fixed certain data being reset after changing HTTP method","Fixed response viewer showing nothing for malformed responses"]},{"date":"2016-09-24T03:00:39-07:00","version":"3.5.2","channel":"stable","link":null,"major":[],"minor":["Query tab parameters no longer encode already encoded data"],"fixes":["Fixed code generation not working in some cases"]},{"date":"2016-09-22T19:27:39-07:00","version":"3.5.1","channel":"stable","link":null,"major":["Huge performance improvements for bulk action like deleting/duplicating folders"],"minor":["No longer encode already encoded URLs","Updates are now served through a CDN (faster downloads)"],"fixes":["Fixed styles for cookie editor filter text box","Fixed double encoding spaces in urls","Improved layout for bulk headers editor"]},{"date":"2016-09-21T01:58:49-07:00","version":"3.4.4","channel":"stable","link":null,"major":[],"minor":["Specify better default monospace font for Windows"],"fixes":["Fixed environments not refreshing or updating sometimes","Fixed sidebar double toggling with keyboard shortcut","Fix for certain users that could not communicate with localhost","Fixed bug that allowed the addition of multiple rows on the auth form"]},{"date":"2016-09-13T17:56:50-07:00","version":"3.4.1","channel":"stable","link":null,"major":["XML response formatting","XPath and JSONPath filtering for responses","Workspaces now appear in the Quick Switcher","Hide the sidebar with ctrl+\\\\ (cmd on Mac)","Use template variables inside environments","Ability to beautify the request body for JSON or XML","Added button to cancel the current request"],"minor":["Added ability to duplicate folders","Add extra prompt before deleting things","Added Nunjucks tags {% timestamp %} and {% uuid %}","Renamed Params tab to Query to avoid confusion","Improved response Raw view performance","Comments in editor are now more visible","Reduced update check frequency from 30 minutes to 3 hours"],"fixes":["Fixed minor bug with Curl import","Querystring is now added to generated code (oops)","Can now re-open window via doc icon if closed (Mac)","HTTPS proxy now works again","Dragging sidebar dropdowns no longer triggers drag-n-drop","Global shortcuts (like sending request) are now prevented when dialogs are open"]},{"date":"2016-09-10T17:56:50-07:00","version":"3.3.2","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Template variables were being persisted after render in some cases","Fixed incorrect binding of checkbox label in settings"]},{"date":"2016-09-05T17:56:50-07:00","version":"3.3.1","channel":"stable","link":null,"major":["Improved speed of rendering large responses","Old responses are no longer kept around when not needed","Decreased initial app loading times","Reduced RAM usage"],"minor":[],"fixes":["Small bug causing some dialogs to not work"]},{"date":"2016-09-03T17:56:50-07:00","version":"3.2.9","channel":"stable","link":null,"major":[],"minor":["More flexible JSON content-type matching for responses","Editor rendering no longer blocks UI navigation on larger responses"],"fixes":["Properly encode URI paths (like v2.0 used to)","Copy/paste from context menu now works on Windows and Linux"]},{"date":"2016-09-01T17:56:50-07:00","version":"3.2.6","channel":"stable","link":null,"major":[],"minor":["Add helpful hints on certain request errors","Increased default font size (adjustable with ctrl+Plus and ctrl+Minus)"],"fixes":["Stop checking for updates after initial update prompt"]},{"date":"2016-08-28T17:56:50-07:00","version":"3.2.3","channel":"stable","link":null,"major":["Added ability to edit headers in bulk"],"minor":["Improved menu bar menus on MacOS","Update Nunjucks to version 2.4.2"],"fixes":["Environment manager now shows detailed JSON errors when invalid"]},{"date":"2016-08-23T17:56:50-07:00","version":"3.2.2","channel":"stable","link":null,"major":[],"minor":["Linux version will now prompt when an update is available"],"fixes":["Cookies dialog showed nothing in some cases"]},{"date":"2016-08-17T17:49:00-07:00","version":"3.2.1","channel":"stable","link":null,"major":[],"minor":["Params tab Url Preview is now selectable","Add hotkey for app minimize"],"fixes":["Settings dialog no longer resets after toggling","Request duplication works again","Silence auto-update errors when no internet"]},{"date":"2016-08-09T22:13:16-07:00","version":"3.2.0","channel":"stable","link":null,"major":["Can now create global environments! (folder environments will extend them)","Cookie management! View/create/update/delete those tasty cookies","Now generate code snippets for nodeJS, Java, Python, Go, and more!","Added new Cookies tab to response pane","Added network proxy setting (experimental)"],"minor":["Now prompt for name when creating new requests and folders","Now support Nunjucks templating in form data bodies","Focusing URL bar (cmd+L) now selects text all text","Minor style updates","Exported data now includes workspace information","Added ability to export only the current workspace"],"fixes":["Data export now exports properly (was broken before)","Fixed the key/value editor from resetting cursor while typing","Send-request keyboard shortcut no longer adds new key/value pairs"]},{"date":"2016-08-03T16:57:51-07:00","version":"3.0.16","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Fix for app crash on first launch"]},{"date":"2016-07-29T20:31:19-07:00","version":"3.0.15","channel":"stable","link":null,"major":[],"minor":[],"fixes":["Request body editor now updates again when changing modes","JSON highlighting edge case fixed"]},{"date":"2016-07-29T16:31:40-07:00","version":"3.0.14","channel":"stable","link":null,"major":[],"minor":["Adjusted cursor padding in the request body editor","Remember zoom level on app launch (note: your saved window size/position will be reset)"],"fixes":["Environment editor now updates properly again"]},{"date":"2016-07-28T18:19:47-07:00","version":"3.0.13","channel":"stable","link":null,"major":["Added setting to disable SSL validation","Save and send cookies (more/better cookie support coming soon...)"],"minor":["Made initial app window size larger","Specify that environment data needs to be JSON format"],"fixes":["Fixed bug where certain input fields would override user input","Params editor now scrolls when too long"]},{"date":"2016-07-27T19:33:15-07:00","version":"3.0.11","channel":"stable","link":null,"major":["Format JSON even when JSON content-type response header missing","Remember last window size and position on launch"],"minor":["Made the import feature more apparent on first launch","Now check for updates every hour (instead of just on launch)"],"fixes":["Drag-n-drop folders now works again (oops)","Adjusted sidebar colors for better visibility"]},{"date":"2016-07-25T20:31:28-07:00","version":"3.0.10","channel":"stable","link":null,"major":["Redesigned interface","No longer a Chrome app","Lots more!"],"minor":[],"fixes":[]}]